WefaaRobotics/Smorphi_Board/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL SMORPHI BOARDS! ###
##############################################################

smorphiesp32.name=smorphiesp32 Dev Module

smorphiesp32.bootloader.tool=esptool_py
smorphiesp32.bootloader.tool.default=esptool_py

smorphiesp32.upload.tool=esptool_py
smorphiesp32.upload.tool.default=esptool_py
smorphiesp32.upload.tool.network=esp_ota

smorphiesp32.upload.maximum_size=1310720
smorphiesp32.upload.maximum_data_size=327680
smorphiesp32.upload.flags=
smorphiesp32.upload.extra_flags=

smorphiesp32.serial.disableDTR=true
smorphiesp32.serial.disableRTS=true

smorphiesp32.build.tarch=xtensa
smorphiesp32.build.bootloader_addr=0x1000
smorphiesp32.build.target=esp32
smorphiesp32.build.mcu=esp32
smorphiesp32.build.core=esp32
smorphiesp32.build.variant=smorphiesp32
smorphiesp32.build.board=ESP32_DEV 

smorphiesp32.build.f_cpu=240000000L
smorphiesp32.build.flash_size=4MB
smorphiesp32.build.flash_freq=40m
smorphiesp32.build.flash_mode=dio
smorphiesp32.build.boot=dio
smorphiesp32.build.partitions=default
smorphiesp32.build.defines=
smorphiesp32.build.loop_core=
smorphiesp32.build.event_core=

smorphiesp32.menu.PSRAM.disabled=Disabled
smorphiesp32.menu.PSRAM.disabled.build.defines=
smorphiesp32.menu.PSRAM.disabled.build.extra_libs=
smorphiesp32.menu.PSRAM.enabled=Enabled
smorphiesp32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
smorphiesp32.menu.PSRAM.enabled.build.extra_libs=

smorphiesp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
smorphiesp32.menu.PartitionScheme.default.build.partitions=default
smorphiesp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
smorphiesp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
smorphiesp32.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
smorphiesp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
smorphiesp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
smorphiesp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
smorphiesp32.menu.PartitionScheme.minimal.build.partitions=minimal
smorphiesp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
smorphiesp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
smorphiesp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
smorphiesp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
smorphiesp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
smorphiesp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
smorphiesp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
smorphiesp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
smorphiesp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
smorphiesp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
smorphiesp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
smorphiesp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
smorphiesp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
smorphiesp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
smorphiesp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
smorphiesp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
smorphiesp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
smorphiesp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
smorphiesp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
smorphiesp32.menu.PartitionScheme.fatflash.build.partitions=ffat
smorphiesp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
smorphiesp32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
smorphiesp32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
smorphiesp32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
smorphiesp32.menu.PartitionScheme.rainmaker=RainMaker
smorphiesp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
smorphiesp32.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

smorphiesp32.menu.CPUFreq.240=240MHz (WiFi/BT)
smorphiesp32.menu.CPUFreq.240.build.f_cpu=240000000L
smorphiesp32.menu.CPUFreq.160=160MHz (WiFi/BT)
smorphiesp32.menu.CPUFreq.160.build.f_cpu=160000000L
smorphiesp32.menu.CPUFreq.80=80MHz (WiFi/BT)
smorphiesp32.menu.CPUFreq.80.build.f_cpu=80000000L
smorphiesp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
smorphiesp32.menu.CPUFreq.40.build.f_cpu=40000000L
smorphiesp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
smorphiesp32.menu.CPUFreq.26.build.f_cpu=26000000L
smorphiesp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
smorphiesp32.menu.CPUFreq.20.build.f_cpu=20000000L
smorphiesp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
smorphiesp32.menu.CPUFreq.13.build.f_cpu=13000000L
smorphiesp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
smorphiesp32.menu.CPUFreq.10.build.f_cpu=10000000L

smorphiesp32.menu.FlashMode.qio=QIO
smorphiesp32.menu.FlashMode.qio.build.flash_mode=dio
smorphiesp32.menu.FlashMode.qio.build.boot=qio
smorphiesp32.menu.FlashMode.dio=DIO
smorphiesp32.menu.FlashMode.dio.build.flash_mode=dio
smorphiesp32.menu.FlashMode.dio.build.boot=dio
smorphiesp32.menu.FlashMode.qout=QOUT
smorphiesp32.menu.FlashMode.qout.build.flash_mode=dout
smorphiesp32.menu.FlashMode.qout.build.boot=qout
smorphiesp32.menu.FlashMode.dout=DOUT
smorphiesp32.menu.FlashMode.dout.build.flash_mode=dout
smorphiesp32.menu.FlashMode.dout.build.boot=dout

smorphiesp32.menu.FlashFreq.80=80MHz
smorphiesp32.menu.FlashFreq.80.build.flash_freq=80m
smorphiesp32.menu.FlashFreq.40=40MHz
smorphiesp32.menu.FlashFreq.40.build.flash_freq=40m

smorphiesp32.menu.FlashSize.4M=4MB (32Mb)
smorphiesp32.menu.FlashSize.4M.build.flash_size=4MB
smorphiesp32.menu.FlashSize.8M=8MB (64Mb)
smorphiesp32.menu.FlashSize.8M.build.flash_size=8MB
smorphiesp32.menu.FlashSize.8M.build.partitions=default_8MB
smorphiesp32.menu.FlashSize.2M=2MB (16Mb)
smorphiesp32.menu.FlashSize.2M.build.flash_size=2MB
smorphiesp32.menu.FlashSize.2M.build.partitions=minimal
smorphiesp32.menu.FlashSize.16M=16MB (128Mb)
smorphiesp32.menu.FlashSize.16M.build.flash_size=16MB

smorphiesp32.menu.UploadSpeed.921600=921600
smorphiesp32.menu.UploadSpeed.921600.upload.speed=921600
smorphiesp32.menu.UploadSpeed.115200=115200
smorphiesp32.menu.UploadSpeed.115200.upload.speed=115200
smorphiesp32.menu.UploadSpeed.256000.windows=256000
smorphiesp32.menu.UploadSpeed.256000.upload.speed=256000
smorphiesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
smorphiesp32.menu.UploadSpeed.230400=230400
smorphiesp32.menu.UploadSpeed.230400.upload.speed=230400
smorphiesp32.menu.UploadSpeed.460800.linux=460800
smorphiesp32.menu.UploadSpeed.460800.macosx=460800
smorphiesp32.menu.UploadSpeed.460800.upload.speed=460800
smorphiesp32.menu.UploadSpeed.512000.windows=512000
smorphiesp32.menu.UploadSpeed.512000.upload.speed=512000

smorphiesp32.menu.LoopCore.1=Core 1
smorphiesp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
smorphiesp32.menu.LoopCore.0=Core 0
smorphiesp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

smorphiesp32.menu.EventsCore.1=Core 1
smorphiesp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
smorphiesp32.menu.EventsCore.0=Core 0
smorphiesp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

smorphiesp32.menu.DebugLevel.none=None
smorphiesp32.menu.DebugLevel.none.build.code_debug=0
smorphiesp32.menu.DebugLevel.error=Error
smorphiesp32.menu.DebugLevel.error.build.code_debug=1
smorphiesp32.menu.DebugLevel.warn=Warn
smorphiesp32.menu.DebugLevel.warn.build.code_debug=2
smorphiesp32.menu.DebugLevel.info=Info
smorphiesp32.menu.DebugLevel.info.build.code_debug=3
smorphiesp32.menu.DebugLevel.debug=Debug
smorphiesp32.menu.DebugLevel.debug.build.code_debug=4
smorphiesp32.menu.DebugLevel.verbose=Verbose
smorphiesp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

smorphiesp32cam.name=smorphiesp32-CAM

smorphiesp32cam.bootloader.tool=esptool_py
smorphiesp32cam.bootloader.tool.default=esptool_py

smorphiesp32cam.upload.tool=esptool_py
smorphiesp32cam.upload.tool.default=esptool_py
smorphiesp32cam.upload.tool.network=esp_ota

smorphiesp32cam.upload.maximum_size=3145728
smorphiesp32cam.upload.maximum_data_size=327680
smorphiesp32cam.upload.flags=
smorphiesp32cam.upload.extra_flags=
smorphiesp32cam.upload.speed=460800

smorphiesp32cam.serial.disableDTR=true
smorphiesp32cam.serial.disableRTS=true

smorphiesp32cam.build.tarch=xtensa
smorphiesp32cam.build.bootloader_addr=0x1000
smorphiesp32cam.build.target=esp32
smorphiesp32cam.build.mcu=esp32
esp32cam.build.core=esp32
smorphiesp32cam.build.variant=smorphiesp32
smorphiesp32cam.build.board=ESP32_DEV
smorphiesp32cam.build.flash_size=4MB
smorphiesp32cam.build.partitions=huge_app
smorphiesp32cam.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
smorphiesp32cam.build.extra_libs=
smorphiesp32cam.build.code_debug=0

smorphiesp32cam.menu.CPUFreq.240=240MHz (WiFi/BT)
smorphiesp32cam.menu.CPUFreq.240.build.f_cpu=240000000L
smorphiesp32cam.menu.CPUFreq.160=160MHz (WiFi/BT)
smorphiesp32cam.menu.CPUFreq.160.build.f_cpu=160000000L
smorphiesp32cam.menu.CPUFreq.80=80MHz (WiFi/BT)
smorphiesp32cam.menu.CPUFreq.80.build.f_cpu=80000000L
smorphiesp32cam.menu.CPUFreq.40=40MHz (40MHz XTAL)
smorphiesp32cam.menu.CPUFreq.40.build.f_cpu=40000000L
smorphiesp32cam.menu.CPUFreq.26=26MHz (26MHz XTAL)
smorphiesp32cam.menu.CPUFreq.26.build.f_cpu=26000000L
smorphiesp32cam.menu.CPUFreq.20=20MHz (40MHz XTAL)
smorphiesp32cam.menu.CPUFreq.20.build.f_cpu=20000000L
smorphiesp32cam.menu.CPUFreq.13=13MHz (26MHz XTAL)
smorphiesp32cam.menu.CPUFreq.13.build.f_cpu=13000000L
smorphiesp32cam.menu.CPUFreq.10=10MHz (40MHz XTAL)
smorphiesp32cam.menu.CPUFreq.10.build.f_cpu=10000000L

smorphiesp32cam.menu.FlashMode.qio=QIO
smorphiesp32cam.menu.FlashMode.qio.build.flash_mode=dio
smorphiesp32cam.menu.FlashMode.qio.build.boot=qio
smorphiesp32cam.menu.FlashMode.dio=DIO
smorphiesp32cam.menu.FlashMode.dio.build.flash_mode=dio
smorphiesp32cam.menu.FlashMode.dio.build.boot=dio
smorphiesp32cam.menu.FlashMode.qout=QOUT
smorphiesp32cam.menu.FlashMode.qout.build.flash_mode=dout
smorphiesp32cam.menu.FlashMode.qout.build.boot=qout
smorphiesp32cam.menu.FlashMode.dout=DOUT
smorphiesp32cam.menu.FlashMode.dout.build.flash_mode=dout
smorphiesp32cam.menu.FlashMode.dout.build.boot=dout

smorphiesp32cam.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.huge_app.build.partitions=huge_app
smorphiesp32cam.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
smorphiesp32cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
smorphiesp32cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
smorphiesp32cam.menu.PartitionScheme.default=Regular 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.default.build.partitions=default
smorphiesp32cam.menu.PartitionScheme.defaultffat=Regular 4MB with ffat (1.2MB APP/1.5MB FATFS)
smorphiesp32cam.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
smorphiesp32cam.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.minimal.build.partitions=minimal
smorphiesp32cam.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
smorphiesp32cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
smorphiesp32cam.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
smorphiesp32cam.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
smorphiesp32cam.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
smorphiesp32cam.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
smorphiesp32cam.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
smorphiesp32cam.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
smorphiesp32cam.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
smorphiesp32cam.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
smorphiesp32cam.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

smorphiesp32cam.menu.FlashFreq.80=80MHz
smorphiesp32cam.menu.FlashFreq.80.build.flash_freq=80m
smorphiesp32cam.menu.FlashFreq.40=40MHz
smorphiesp32cam.menu.FlashFreq.40.build.flash_freq=40m

smorphiesp32cam.menu.DebugLevel.none=None
smorphiesp32cam.menu.DebugLevel.none.build.code_debug=0
smorphiesp32cam.menu.DebugLevel.error=Error
smorphiesp32cam.menu.DebugLevel.error.build.code_debug=1
smorphiesp32cam.menu.DebugLevel.warn=Warn
smorphiesp32cam.menu.DebugLevel.warn.build.code_debug=2
smorphiesp32cam.menu.DebugLevel.info=Info
smorphiesp32cam.menu.DebugLevel.info.build.code_debug=3
smorphiesp32cam.menu.DebugLevel.debug=Debug
smorphiesp32cam.menu.DebugLevel.debug.build.code_debug=4
smorphiesp32cam.menu.DebugLevel.verbose=Verbose
smorphiesp32cam.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
